idaohang/stm32gps-sleep/Project/stm32gps/main.c
/******************************************************************************

              Copyright (C), 2014, BoraNet Corporation

 ******************************************************************************
  File Name     : main.c
  Version       : Initial Draft
  Author        : Qixb
  Created       : 2014/12/16
  Last Modified :
  Description   : Main program body
  Function List :
              GetStickState
              InitVariables
              main
              PackAlarmMsg
              PackFactoryMsg
              PackGpsMsg
              PackLoginMsg
              PackStationMsg
              ProcessIMEI
              ShowGpsData
              ShowGpsMsg
              ShowLoginMsg
  History       :
  1.Date        : 2014/12/16
    Author      : Qixb
    Modification: Created file

******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_it_api.h"
#include "stm32gps_board.h"
#include "stm32gps_config.h"
#include <stdio.h>
#include <string.h>
#include "usart.h"
#include "GSM_App.h"
#include "device.h"
#include "eelink.h"
#include "gpio.h"
#include "gps.h"

/*----------------------------------------------*
 * external variables                           *
 *----------------------------------------------*/

/*----------------------------------------------*
 * external routine prototypes                  *
 *----------------------------------------------*/

/*----------------------------------------------*
 * internal routine prototypes                  *
 *----------------------------------------------*/
FlagStatus GetStickState(void);
FlagStatus CheckRestartState(void);
static uint8_t ProcessIMEI(uint8_t *pImei, uint8_t *pRst, int32_t imeilen, int32_t rstlen);
static void PackLoginMsg(void);
static void PackGpsMsg(void);
static void PackAlarmMsg(void);
static void PackStationMsg(void);
static void PackFactoryMsg(void);
/*----------------------------------------------*
 * project-wide global variables                *
 *----------------------------------------------*/

/*----------------------------------------------*
 * module-wide global variables                 *
 *----------------------------------------------*/
static uint16_t g_usSequenceNum;  		// Packet's sequence number
static uint8_t g_ucGPSStatus;    		// GPS UART's status 0x55 - error; 0xaa - ok
static uint32_t g_uiSetSleepSec;  		// Sleepy seconds from server's reply
static FlagStatus g_uiAlarmFlag;  		// 报警标志 SET - valid; RESET - invalid
static FlagStatus g_uiAlarmPacketFlag; 	// 报警数据包标志 SET - alarm packet; RESET - not alarm packet
static FlagStatus g_uiPreStickFlag; 	// 吸合状态 SET - Stick ON; RESET - Stick OFF
static FlagStatus g_uiCurStickFlag; 	// 吸合状态 SET - Stick ON; RESET - Stick OFF

static uint8_t g_ucSignalQuality;		// Signal Quality

static ST_DEVICEDATA g_stDeviceData;	// Device Status
static ST_BATVOLTAGESTATUS g_stBATInfo;	// Battery Info
static ST_CREGINFO g_stCREGInfo;		// Network Registeration Info
static ST_IMSIINFO g_stIMSIInfo;		// IMSI Info
static stru_GPSDATA g_stGPSData;		// GPS Received Data
static ST_PACKET_BASESTATION g_stStationInfo;		// Station Info Received from CENG

static uint8_t g_ucIMEIBuf[IMEI_BUF_LEN];			// IMSI Buffer
static uint8_t g_ucIMSIBuf[IMSI_BUF_LEN];			// IMSI Buffer
static uint8_t g_ucPhoneNumBuf[PHONE_NUM_BUF_LEN];	// Phone Number Buffer

static char LoginBuf[PROTO_LOGIN_BUF_LEN];			// LOGIN Packet Buffer
static char gpsBuf[PROTO_GPS_BUF_LEN];				// GPS / STATIN / ALARM Packet Buffer
/*----------------------------------------------*
 * constants                                    *
 *----------------------------------------------*/

/*----------------------------------------------*
 * macros                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * routines' implementations                    *
 *----------------------------------------------*/

#ifdef DBG_ENABLE_MACRO
void ShowLoginMsg(void)
{
    uint32_t i;
    // imei
    DEBUG("IMEI:");
    for(i = 0; i < IMEI_BUF_LEN; i++)
    {
        DEBUG("%c-", g_ucIMEIBuf[i]);
    }
    DEBUG("\r\n");
    // login msg
    DEBUG("\r\nLOGIN MSG:");
    for(i = 0; i < PROTO_LOGIN_BUF_LEN; i++)
    {
        DEBUG("0x%x-", LoginBuf[i]);
    }
    DEBUG("\r\n");
}

void ShowGpsMsg(uint32_t len)
{
    uint32_t i;
    // gps msg
    DEBUG("\r\n GPS,STATION or ALARM MSG:");
    for(i = 0; i < len; i++)
    {
        DEBUG("0x%x-", gpsBuf[i]);
    }
    DEBUG("\r\n");
}

void ShowGpsData(void)
{
    uint32_t i;

    DEBUG("UTC:");
    for(i = 0; i < 4; i++)
    {
        DEBUG("0x%x-", g_stGPSData.utc.s[i]);
    }
    DEBUG("\r\n");

    DEBUG("LATI:");
    for(i = 0; i < 4; i++)
    {
        DEBUG("0x%x-", g_stGPSData.latitude.s[i]);
    }
    DEBUG("\r\n");

    DEBUG("LONGI:");
    for(i = 0; i < 4; i++)
    {
        DEBUG("0x%x-", g_stGPSData.longitude.s[i]);
    }
    DEBUG("\r\n");

    DEBUG("SPEED: %d\r\n", g_stGPSData.speed);
    DEBUG("COURSE:");
    for(i = 0; i < 2; i++)
    {
        DEBUG("0x%x-", g_stGPSData.course.s[i]);
    }
    DEBUG("\r\n");
    DEBUG("STATUS: %d\r\n", g_stGPSData.status);

}

#endif // DBG_ENABLE_MACRO

/**
  * @brief  Init Global Variables
  * @param  None
  * @retval None
  */
void InitVariables(void)
{
    g_usSequenceNum 	= 1;
    g_ucGPSStatus 		= GPS_DEVICE_ERR;
    g_uiSetSleepSec 	= SLEEP_NORMAL_SEC;
    g_uiAlarmFlag 		= RESET;
    g_uiAlarmPacketFlag = RESET;
    g_uiPreStickFlag 	= RESET;
    g_uiCurStickFlag 	= RESET;

    g_ucSignalQuality 	= 0;

    memset(&g_stDeviceData, 0, sizeof(g_stDeviceData));
    memset(&g_stBATInfo, 0, sizeof(g_stBATInfo));
    memset(&g_stCREGInfo, 0, sizeof(g_stCREGInfo));
    memset(&g_stIMSIInfo, 0, sizeof(g_stIMSIInfo));
    memset(&g_stGPSData, 0, sizeof(g_stGPSData));
    memset(&g_stStationInfo, 0, sizeof(g_stStationInfo));

    memset(g_ucIMEIBuf, 0, IMEI_BUF_LEN);
    memset(g_ucIMSIBuf, 0, IMSI_BUF_LEN);
    memset(g_ucPhoneNumBuf, 0, PHONE_NUM_BUF_LEN);

