idaohang/stm32gps-sleep/Project/stm32gps/main.c
    memset(LoginBuf, 0, PROTO_LOGIN_BUF_LEN);
    memset(gpsBuf, 0, PROTO_GPS_BUF_LEN);
}

/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void)
{
    uint32_t errNum 		= 0;	// Error Num
    uint8_t gpsRecvTimes 	= 0;  	// GPS Received Times
    uint8_t gsmRetyTimes 	= 0;  	// GSM Retry Times
    uint8_t gprsRetyTimes 	= 0; 	// GPRS Retry Times

    uint8_t gpsRtn 			= RST_FAIL;    	// GPS Function return result
    uint8_t gsmRtn 			= RST_FAIL;		// GSM Function return result
    uint8_t gprsRtn 		= USART_FAIL;	// GPRS Function return result
    uint8_t gprsSendFlag 	= RST_FAIL; 	// GPRS Send Status Flag

    uint16_t sendLen 		= 0;    // GPRS send length (used for GPS and ALARM Msg)
    uint32_t sleepSec 		= 0;	// Sleep Seconds from server's reply

    // Used for parse GPRS Received Data Analysis
    char *pRecvBuf 			= NULL;  	// GPRS Received buffer
    uint32_t recvLen 		= 0;      	// GPRS Received length
    char *pfeed 			= NULL;     // Used for parse

    // Used for CheckLinkStatus
#ifdef DBG_ENABLE_MACRO
    uint8_t tmpStatus = 0;		// temp variable
#endif

    /////////////////////////////////////////////////////////////////
    // Configure the GPIO ports and Power OFF GPS and GSM
    /////////////////////////////////////////////////////////////////
    MX_GPIO_Init();
    GPSPowerOff();
    GSM_PowerOff();

    /////////////////////////////////////////////////////////////////
    // Configure the SysTick
    /////////////////////////////////////////////////////////////////
    SYSTICK_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure PWR and BKP
    /////////////////////////////////////////////////////////////////
    /* Enable PWR and BKP clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
    /* Enable WKUP pin */
    //    PWR_WakeUpPinCmd(ENABLE);

    /////////////////////////////////////////////////////////////////
    // Configure RCC (NOT IN NEED)
    /////////////////////////////////////////////////////////////////
    //RCC_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure RTC EXTI
    /////////////////////////////////////////////////////////////////
    EXTI_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure NVIC
    /////////////////////////////////////////////////////////////////
    NVIC_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure RTC
    /////////////////////////////////////////////////////////////////
    RTC_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure TIMER
    /////////////////////////////////////////////////////////////////
    TIM2_Configuration();

    /////////////////////////////////////////////////////////////////
    // Configure LED, BUTTON and USART(GPS + GSM + DEBUG)
    /////////////////////////////////////////////////////////////////

    STM_EVAL_LEDOff();
#ifdef DBG_ENABLE_MACRO
    stm32gps_com_debug_cfg();
#endif // DBG_ENABLE_MACRO

    stm32gps_com_gps_cfg();

    usart_gsm_init();
    stm32gps_com_gsm_cfg();
    /* Enable the EVAL_COM2 Receive interrupt: this interrupt is generated when the
     EVAL_COM1 receive data register is not empty */
    USART_ITConfig(EVAL_COM2, USART_IT_RXNE, ENABLE);

    /////////////////////////////////////////////////////////////////
    // Turn On TIM2
    /////////////////////////////////////////////////////////////////
    //TIM2_Start();

    /////////////////////////////////////////////////////////////////
    // Init Global Variables
    /////////////////////////////////////////////////////////////////
    InitVariables();

    /////////////////////////////////////////////////////////////////
    // Main LOOP
    /////////////////////////////////////////////////////////////////
    while(1)
    {
        /////////////////////////////////////////////////////////////////
        // Init Local Variables
        /////////////////////////////////////////////////////////////////
        errNum = 0;
        gpsRecvTimes = 0;
        gsmRetyTimes = 0;
        gprsRetyTimes = 0;

        gpsRtn = RST_FAIL;
        gprsSendFlag = RST_FAIL;

        sendLen = 0;
        sleepSec = 0;
#if 0
        /////////////////////////////////////////////////////////////////
        // Check Restart State (A Back Door)
        /////////////////////////////////////////////////////////////////
        if(SET == CheckRestartState())
        {
            // Soft RESET
            __set_FAULTMASK(1);      // Close ALL Interrupts
            NVIC_SystemReset();
        }
#endif
        // Delay 3 Sec
        delay_10ms(STICK_ON_SEC);
        /////////////////////////////////////////////////////////////////
        // Detect Stick Status
        /////////////////////////////////////////////////////////////////
        g_uiCurStickFlag = GetStickState();
        if((RESET == g_uiCurStickFlag) && (g_uiCurStickFlag != g_uiPreStickFlag))
        {
            g_uiAlarmFlag = SET;
        }
        g_uiPreStickFlag = g_uiCurStickFlag;

        DEBUG("\r g_uiCurStickFlag = %d; g_uiAlarmFlag = %d; g_uiAlarmPacketFlag = %d\n", g_uiCurStickFlag, g_uiAlarmFlag, g_uiAlarmPacketFlag);
        // If Stick On Car or sth
        if((SET == g_uiCurStickFlag) || (SET == g_uiAlarmFlag) || (SET == g_uiAlarmPacketFlag))
        {

            // GPS ALARM
            if(SET != g_uiAlarmFlag)
            {
                /////////////////////////////////////////////////////////////////
                // First, Power ON GPS
                /////////////////////////////////////////////////////////////////
                GPSPowerOn();
                DEBUG("\r\n GPSPowerOn \r\n");
                delay_10ms(200);
                /////////////////////////////////////////////////////////////////
                // Receive GPS Data and Parse, If Recv Success then break
                /////////////////////////////////////////////////////////////////
                memset(&g_stGPSData, 0, sizeof(g_stGPSData));
#ifdef DBG_ENABLE_MACRO
                ShowGpsData();
#endif
                while(gpsRecvTimes < GPS_RETERY_TIMES)
                {
                    gpsRecvTimes++;
                    TIM2_Start();
                    gpsRtn = GetGPSData();
                    TIM2_Stop();

