idaohang/stm32gps-sleep/Project/stm32gps/main.c
                        }
                    }

                    /////////////////////////////////////////////////////////////////
                    // Send GPS/STATION or ALARM Msg
                    /////////////////////////////////////////////////////////////////
                    g_usSequenceNum++;
                    errNum = 0;
                    gprsRtn = USART_FAIL;

                    if(SET == g_uiAlarmFlag)
                    {
                        PackAlarmMsg();
                        sendLen = EELINK_ALARM_MSGLEN;
                        g_uiAlarmPacketFlag = SET;
                        DEBUG("PackAlarmMsg\r\n");
                    }
                    else
                    {
                        //if(1 == g_stGPSData.status)
                        {
                            PackGpsMsg();
                            sendLen = EELINK_GPS_MSGLEN;
                            DEBUG("PackGpsMsg\r\n");
                        }
                        //else
                        //{
                        //    PackStationMsg();
                        //    sendLen = (8 + (g_stStationInfo.num * 11));
                        //   DEBUG("PackStationMsg\r\n");
                        //}
                        g_uiAlarmPacketFlag = RESET;
                    }

#ifdef DBG_ENABLE_MACRO
                    ShowGpsMsg(sendLen);
#endif

#if 0
                    PackFactoryMsg();
                    sendLen = FACTORY_REPORT_MSGLEN;
#ifdef DBG_ENABLE_MACRO
                    ShowFactoryMsg();
#endif
#endif
                    while(errNum < 5)
                    {
                        errNum++;
                        gprsRtn = GPRS_SendData(gpsBuf, sendLen);
                        if(USART_SUCESS == gprsRtn)
                        {
                            gprsSendFlag = RST_OK;

                            // Toggle alarm flag
                            if((SET == g_uiAlarmFlag) && (SET == g_uiAlarmPacketFlag))
                            {
                                g_uiAlarmFlag = RESET;
                            }

                            // If Send OK, Close Link
                            GPRS_CloseLink();
                            break;
                        }
                    }

                    // break gprs send process
                    if(RST_OK == gprsSendFlag)
                    {
                        break;
                    }

                }

                // break gprs send process
                if(RST_OK == gprsSendFlag)
                {
                    break;
                }
            }

        }

        /////////////////////////////////////////////////////////////////
        // This Process is Finished, Then goto sleep
        /////////////////////////////////////////////////////////////////
        //STM_EVAL_LEDToggle(LED1);
        /////////////////////////////////////////////////////////////////
        // Power OFF GPS and GSM before going into sleep mode
        /////////////////////////////////////////////////////////////////
        //STM_EVAL_LEDOff(LED1);
        //GPRS_CPOwd();
        GPSPowerOff();
        GSM_PowerOff();

        /////////////////////////////////////////////////////////////////
        // Detect Stick Status
        /////////////////////////////////////////////////////////////////
        g_uiCurStickFlag = GetStickState();
        if((RESET == g_uiCurStickFlag) && (g_uiCurStickFlag != g_uiPreStickFlag))
        {
            g_uiAlarmFlag = SET;
        }
        g_uiPreStickFlag = g_uiCurStickFlag;

        /* Wait till RTC Second event occurs */
        RTC_ClearFlag(RTC_FLAG_SEC);
        while(RTC_GetFlagStatus(RTC_FLAG_SEC) == RESET);

        // NOT Stick and Alarm Flag Valid, Then Sleep Less
        if( (SET == g_uiAlarmPacketFlag) || (SET == g_uiAlarmFlag))
        {
            RTC_SetAlarm(RTC_GetCounter() + SLEEP_ALARM_SEC);
            DEBUG("alarmmode sleep %d sec\n", SLEEP_ALARM_SEC);
        }
        else
        {
#ifdef DBG_ENABLE_MACRO
            RTC_SetAlarm(RTC_GetCounter() + 120); // 2 min
            DEBUG("DEBUG normalmode sleep %d sec\n", 120);
#else
            RTC_SetAlarm(RTC_GetCounter() + g_uiSetSleepSec);
            //DEBUG("normalmode sleep %d sec\n", g_uiSetSleepSec);
#endif
        }

        /* Wait until last write operation on RTC registers has finished */
        RTC_WaitForLastTask();

        /* Request to enter STOP mode with regulator in low power mode*/
        PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);

        /* Configures system clock after wake-up from STOP: enable HSE, PLL and select
           PLL as system clock source (HSE and PLL are disabled in STOP mode) */
        SYSCLKConfig_STOP();
    }

    // SHOULD NOT GO HAERE
    while(1)
    {
        // Soft RESET
        __set_FAULTMASK(1);      // Close ALL Interrupts
        NVIC_SystemReset();

        STM_EVAL_LEDToggle();
        delay_10ms(50);
    }
}

/**
  * @brief  Check Button State
  * @param  None
  * @retval FlagStatus SET - Stick ON; RESET - Stick OFF
  */
FlagStatus GetStickState(void)
{
    int i = 0;
    uint32_t cnt = 0;
    FlagStatus curState = SET;

    for(i = 0; i < 4; i++)
    {
        delay_ms(40);
        // Stick On
        if((uint32_t)Bit_RESET == STM_EVAL_PBGetState())
        {
            cnt++;
        }
    }

    if(cnt > 3)
    {
        curState = SET;
    }
    else
    {
        curState = RESET;
    }

    return curState;
}

/**
  * @brief  Check Soft Resart State
  * @param  None
  * @retval FlagStatus SET - Should Restart; RESET - Not Restart
  */
FlagStatus CheckRestartState(void)
{
    int i = 0;
    uint8_t lowCnt = 0;
    uint8_t highCnt = 0;
    FlagStatus curState = RESET;

    for(i = 0; i < 5; i++)
    {
        delay_ms(2000);
        // Stick On
        if((uint32_t)Bit_RESET == STM_EVAL_PBGetState())
        {
            lowCnt++;
        }
        else
        {
            highCnt++;
        }
    }

