idaohang/stm32gps-sleep/Project/stm32gps/main.c
    if((lowCnt >= 2) && (highCnt >= 2))
    {
        curState = SET;
    }
    else
    {
        curState = RESET;
    }

    return curState;
}

/***************************************************************************
 ** Function name:       ProcessIMEI()
 ** Descriptions:        将15个字节的IMEI字符串处理成8个字节的EELINK协议格式
 ** input parameters:    pImei 需要处理的15个字节的IMEI字符串
 **                      pRst 返回的字符串指针
 **                      imeilen IMEI字符串的长度
 **                      rstlen 返回的字符串的长度
 ** output parameters:
 ** Returned value:      成功RST_OK 失败RST_FAIL
 ****************************************************************************/
uint8_t ProcessIMEI(uint8_t *pImei, uint8_t *pRst, int32_t imeilen, int32_t rstlen)
{
    uint32_t i;
    if(((imeilen / 2 + 1) < rstlen) || (imeilen != 15))
    {
        return RST_FAIL;
    }

    *(pRst + 0) = (*(pImei + 0)) & 0x0F;
    for(i = (imeilen / 2); i > 0 ; i--)
    {
        *(pRst + i) = (((*(pImei + i * 2 - 1)) << 4) & 0xF0) + ((*(pImei + i * 2)) & 0x0F);
    }
    return RST_OK;
}


/**
  * @brief  Load stLoginMsg structure to send buffer
  * @param  None
  * @retval None
  */
void PackLoginMsg(void)
{
    uint32_t i;
    uint32_t offset;
    uint8_t ucIMEIBuf[IMEI_BUF_LEN];

    offset = 0;
    // header
    for(i = 0; i < 2; i++)
    {
        LoginBuf[offset] = PROTO_EELINK_HEADER;
        offset++;
    }
    // type
    LoginBuf[offset] = PACKET_EELINK_LOGIN;
    offset++;
    // length
    LoginBuf[offset] = 0x00;
    offset++;
    LoginBuf[offset] = 0x0C;
    offset++;
    // sequence
    LoginBuf[offset] = (uint8_t)((g_usSequenceNum >> 8) & 0x00FF);
    offset++;
    LoginBuf[offset] = (uint8_t)((g_usSequenceNum) & 0x00FF);
    offset++;
    // imei
    if(RST_FAIL == ProcessIMEI(g_ucIMEIBuf, ucIMEIBuf, IMEI_BUF_LEN, 8))
    {
        // re-init imei buffer
        memset(ucIMEIBuf, 0, IMEI_BUF_LEN);
        DEBUG("IMEI process ERROR!\n");
    }
    for(i = 0; i < 8; i++)
    {
        LoginBuf[offset] = ucIMEIBuf[i];
        offset++;
    }
    // lang
    LoginBuf[offset] = EELINK_LANG;
    offset++;
    // zone
    LoginBuf[offset] = EELINK_ZONE;
    offset++;
    if(offset != (EELINK_LOGIN_MSGLEN))
    {
        DEBUG("PackLoginMsg ERROR!\n");
    }
}


/**
  * @brief  Load gpsMsg structure to send buffer
  * @param  None
  * @retval None
  */
void PackGpsMsg(void)
{
    uint32_t i;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = PROTO_EELINK_HEADER;
        offset++;
    }
    gpsBuf[offset] = PACKET_EELINK_GPS;
    offset++;
    gpsBuf[offset] = 0x00;
    offset++;
    gpsBuf[offset] = (EELINK_GPS_MSGLEN - 5); // 37
    offset++;
    gpsBuf[offset] = (uint8_t)((g_usSequenceNum >> 8) & 0x00FF);
    offset++;
    gpsBuf[offset] = (uint8_t)((g_usSequenceNum) & 0x00FF);
    offset++;
    // UTC日期时间
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = g_stGPSData.utc.s[3 - i];
        offset++;
    }
    // 纬度
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = g_stGPSData.latitude.s[3 - i];
        offset++;
    }
    // 经度
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = g_stGPSData.longitude.s[3 - i];
        offset++;
    }
    // 速度
    gpsBuf[offset] = g_stGPSData.speed;
    offset++;
    // 航向
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stGPSData.course.s[1 - i];
        offset++;
    }
    // 基站 9 bytes
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stIMSIInfo.Mcc[i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stIMSIInfo.Mnc[i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stCREGInfo.Lac[i];
        offset++;
    }
    gpsBuf[offset] = 0;  // 补零
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stCREGInfo.Ci[i];
        offset++;
    }
    // 定位状态
    gpsBuf[offset] = g_stGPSData.status;
    offset++;
    // 设备状态
    gpsBuf[offset] = 0x00;  // 补零
    offset++;
	if(SET == g_uiCurStickFlag)
	{
		// 吸合
    	gpsBuf[offset] = g_stGPSData.status;
	}
	else
	{
		gpsBuf[offset] = g_stGPSData.status + 2;
	}
    offset++;
    // 电池电压
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stBATInfo.BatVoltage.s[1 - i];
        offset++;
    }
    // 信号强度
    gpsBuf[offset] = 0;  // 补零
    offset++;
    gpsBuf[offset] = g_ucSignalQuality;
    offset++;
    // 模拟输入1
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stDeviceData.analog1[i];
        offset++;
    }
    // 模拟输入2
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stDeviceData.analog2[i];
        offset++;
    }

    if(offset != (EELINK_GPS_MSGLEN))
    {
        DEBUG("PackGpsMsg ERROR!\n");
    }
}

/**
  * @brief  Load gpsMsg structure to alarm send buffer
  * @param  None
  * @retval None
  */
void PackAlarmMsg(void)
{
    uint32_t i;
    uint32_t offset;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = PROTO_EELINK_HEADER;
        offset++;
    }
    gpsBuf[offset] = PACKET_EELINK_WARNING; //gpsMsg.hdr.type;
    offset++;
    gpsBuf[offset] = 0; // header len
    offset++;
    gpsBuf[offset] = (EELINK_ALARM_MSGLEN - 5); // header len
    offset++;
    gpsBuf[offset] = (uint8_t)((g_usSequenceNum >> 8) & 0x00FF);
    offset++;
    gpsBuf[offset] = (uint8_t)((g_usSequenceNum) & 0x00FF);
    offset++;

    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = g_stGPSData.utc.s[3 - i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = g_stGPSData.latitude.s[3 - i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = g_stGPSData.longitude.s[3 - i];
        offset++;
    }
    gpsBuf[offset] = g_stGPSData.speed;
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stGPSData.course.s[1 - i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stIMSIInfo.Mcc[i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stIMSIInfo.Mnc[i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stCREGInfo.Lac[i];
        offset++;
    }
    gpsBuf[offset] = 0;  // 补零
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_stCREGInfo.Ci[i];
        offset++;
    }
    gpsBuf[offset] = g_stGPSData.status;
    offset++;
    gpsBuf[offset] = 0x71;  // remove alarm flag
    offset++;

    if(offset != (EELINK_ALARM_MSGLEN))
    {
        DEBUG("PackAlarmMsg ERROR!\n");
    }
}

/**
  * @brief  Load station structure to station buffer
  * @param  None
  * @retval None
  */
void PackStationMsg(void)
{
    uint32_t i;
    uint32_t j = 0;
    uint32_t offset;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = PROTO_EELINK_HEADER;
        offset++;
    }
    gpsBuf[offset] = PACKET_EELINK_STATION; //gpsMsg.hdr.type;
    offset++;
    gpsBuf[offset] = 0; // header len
    offset++;
    gpsBuf[offset] = (3 + (g_stStationInfo.num * 11)); // header len = 7+1+num*11-5
    offset++;
    gpsBuf[offset] = (uint8_t)((g_usSequenceNum >> 8) & 0x00FF);
    offset++;
    gpsBuf[offset] = (uint8_t)((g_usSequenceNum) & 0x00FF);
    offset++;

